meme_dict = {
            "КРИНЖ": "Что-то очень странное или стыдное",
            "ЛОЛ": "Что-то очень смешное",
            "РОФЛ": "шутка",
            "ЩИИИИЩ": "одобрение или восторг",
            "КРИПОВЫЙ": "страшный, пугающий",
            "БРУХ": "разочарование",
            }
word = input("Добро пожаловать в Программу обьяснялку, вот наш список доступных слов ")
for key in meme_dict.keys():
    print(key)
word = input("пожалуйста введите слово что вам не понятно")
if word in meme_dict.keys():
    print(meme_dict[word])
else:
    print("извините, это слово отсутствует в датабазе")
